[
  {
    "title": "COUNTRY FARMS Organic Super Greens Natural Flavor, 50 Organic Super Foods, Packed with Fiber, USDA Organic Drink Mix, Fruits, Vegetables, Mushrooms & Probiotics, Supports Energy, 6g Fiber",
    "price": 12.89,
    "image": "https://m.media-amazon.com/images/I/71xZ1Z-R6TL._AC_SL1500_.jpg",
    "description": "SUPER GREENS DRINK MIXYour mother always told you to eat your vegetables, but have you always followed this sage advice? Experts tell us that most Americans simply don’t consume the amount of greens, fruits and vegetables daily. The whole “juicing” concept flourished from the desire to obtain the valuable nutrition that only Mother Nature can provide.The problem is anyone who’s tried juicing knows that it’s an expensive, time consuming task that often ends up being more of a bother than a health advantage. Now, the solution is convenient and delicious Country Farms Super Greens Drink Mix.This alkalizing, whole food blend of fruits, vegetables, probiotics and greens provides numerous health benefits. This antioxidant-rich, low-calorie drink helps support digestion, energy levels and immune health, while also helping to satisfy hunger.Super Greens is an easy-to-use, delicious drink mix available in natural and berry flavors. One serving delivers an advanced, nutrient-rich profile to enhance your overall health. Enjoy this powerhouse drink mix to get you going in the morning and/or as a snack between meals.",
    "rating": 4.2,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Motsenbocker's Lift Off 45706-3PK Sticker, Tape, and Adhesive Remover Safely Removes Stickers, Pinstriping, Adhesives and More from Vehicles, Boats, RVs, Brick, Concrete and More, 16 Fl Oz, Pack of 3",
    "price": 30.58,
    "image": "https://m.media-amazon.com/images/I/61J3-lZuVqL._AC_SL1000_.jpg",
    "description": "Motsenbocker's Lift Off 45706 Sticker, Tape, and Adhesive Remover is designed to break down molecular bonds, making it highly effective for removing various types of adhesives. This product is ideal for getting rid of bumper stickers, regular stickers, pin striping, spray adhesives, labels, tar, sap, chewing gum, and other sticky residues. It works on a wide range of surfaces, including vehicles, boats, RVs, fiberglass, metal, tile, vinyl, plastic, glass, brick, and concrete. One of the key benefits of this remover is that it’s safe to use on automotive paint and finishes, so you won’t have to worry about damaging your vehicle while cleaning it. Its water-based formula, combined with low VOC (volatile organic compounds), makes it safer for both the user and the environment. Lift Off stain removers can also be used individually or as part of a complete system for tackling more complicated stain removal tasks.",
    "rating": 4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "BONTEC Mobile Standing Desk with Keyboard Tray, Mobile Podium, Computer Workstation Up to 33lbs, Laptop Sit or Stand Desk on Wheels, Height Adjustable Stand Up Table for Living Room, Bedroom, Office",
    "price": 149.99,
    "image": "https://m.media-amazon.com/images/I/61OlsB6H2oL._AC_SL1500_.jpg",
    "description": "Two-tier Mobile Stand Up Desk with Keyboard Tray This two-tier laptop desk with large desk surface can accommodate one laptop, one screen and your keyboard. Its slim, space-saving design means it fits in most spaces. Its easy transition between sitting and standing allows you to convert to your preferred position easily. Advantages of Pneumatic Lever Just pull the lever up to control the height of the desk, which is convenient and accurate for step-less height adjustment. *After the required height is fixed and held for a period of time, the lever will function normal when you slightly lift or press the table top once with another hand. Our standing desk features a convenient lever for easy height adjustment, supported by a powered gas spring for smooth transitions between sitting and standing. Hole for Charger Wire A charger hole allows you to charge your phone easily whilst working. Keyboard Guard The retractable tray can prevent your keyboard from slipping down when pushed forward, securely holding your keyboard in place. Iron Hook This computer workstation desk has hooks that can hang items like earphones and laptop bag to help you make full use of the space under the desk. 360 Degree Castors The 4 castors can move by 360 degrees, making it easy to move the desk to your preferred position; the castors are lockable to secure your desk. Previous page Next page 1 Classroom 2 Living Room 3 Sickroom 4 Bedroom Key Measurements for the Desk The mobile stand up desk has two tiers, the top of which is the desktop, offering enough space for your laptop, phones, pens and other items. The second tier is a retractable tray.You can choose to alternate between sitting and standing as the desk offers a height range of 28.3-44.1inch. Product Comparison MWS04WH Add to Cart MWS03WH Buying Options MWS001BK Add to Cart EH03WH Add to Cart MDM002WH Add to Cart Customer Reviews 4.4 out of 5 stars 567 4.4 out of 5 stars 650 4.6 out of 5 stars 1,780 4.5 out of 5 stars 718 4.6 out of 5 stars 34,254 Price $153.99$153.99 $107.19$107.19 $114.99$114.99 $29.99$29.99 $32.99$32.99 Height Range 28.3~44.1 inch 28.3~44.1 inch 40.5~49 inch X X Load Capicity (Top) 33 LBS 33 LBS 44 LBS 33 LBS 11 LBS Load Capicity (Keyboard Tray) 11 LBS X 22 LBS X X Applied Desktop Size 25.6x17.7 inch 25.6x17.7 inch 23.6x15.7 inch 9.5x9.1 inch 25.6x11.8 inch Tilt ✘ ✘ ✔ ✘ ✘",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "UNIQOOO Wax Seal Stickers - 3D Heart Wedding Invitation Envelope Seal Stickers, 50 Pcs Self- Adhesive Antique Gold Stickers, Perfect for Invitation, Christmas, Gift",
    "price": 11.99,
    "image": "https://m.media-amazon.com/images/I/71GY0QhsyvL._AC_SL1500_.jpg",
    "description": "Invitation Envelope Seal Stickers The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Creative Ways To Use Your Wax Seal Stickers Name Card Place Card Gift Wrapping Seating Chart UNIQOOO Wax Seal Stickers Anti Gold Wax Stickers Add to Cart Light Gold Wax Stickers Add to Cart Olive Green Wax Stickers Add to Cart Terra Cotta Orange Add to Cart Champagne Wax Stickers Add to Cart Sage Green Wax Stickers Add to Cart Dusty Blue Wax Stickers Add to Cart Customer Reviews 4.5 out of 5 stars 369 4.5 out of 5 stars 369 4.5 out of 5 stars 369 4.5 out of 5 stars 369 4.5 out of 5 stars 369 4.5 out of 5 stars 369 4.5 out of 5 stars 369 Price $17.99$17.99 $18.99$18.99 $17.99$17.99 $10.99$10.99 $20.99$20.99 $20.99$20.99 $20.99$20.99 Color Antique Gold Light Gold Olive Green Terra Cotta Orange Champagne Sage Green Dusty Blue Style Rosemary Rosemary Rosemary Rosemary Rosemary Rosemary Rosemary Pieces 100 100 100 50 100 100 100 Size 1.1 inches/28 mm 1.1 inches/28 mm 1.1 inches/28 mm 1.1 inches/28 mm 1.1 inches/28 mm 1.1 inches/28 mm 1.1 inches/28 mm Material Wax Wax Wax Wax Wax Wax Wax Elegant and Beautifully Wax Seals for Every Occasion Anti-gold Wax Stickers Add to Cart Olive Green Wax Stickers Add to Cart Olive Green wax beads Add to Cart Anti-gold Wax Beads Add to Cart Anti-gold Wax Stick Add to Cart Prosecco Wax Stick Add to Cart Pearl White Wax Stickers Add to Cart Customer Reviews 4.7 out of 5 stars 425 4.7 out of 5 stars 425 4.5 out of 5 stars 92 4.7 out of 5 stars 488 4.7 out of 5 stars 1,865 4.7 out of 5 stars 79 4.1 out of 5 stars 90 Price $14.49$14.49 $12.99$12.99 $9.99$9.99 $10.99$10.99 $9.99$9.99 $10.99$10.99 $7.99$7.99 Color Anti-gold Olive Green Olive Green Anti-gold Anti-gold Light Gold Pearl White Size 1.2 inches/30mm 1.2 inches/30mm 2/5 inch (10mm) 2/5 inch (10mm) Full Size Full Size 1.1 inches/28 mm Quantity 50 50 180 180 8 8 50 Pattern Eucalyptus Eucalyptus / / / / Rosemary With Gold Leaf Perfect for Invitations,Envelopes Invitations,Envelopes Invitations,Envelopes Invitations,Envelopes Invitations,Envelopes Invitations,Envelopes Invitations,Envelopes Are these wax seal stickers ready for uses once the adhesive backing is peeled off?Need any additional tools? Yes, the wax seal stickers can be used directly once the adhesive backing is peeled off. They don't require any additional tools or processes. Is the adhesive on the back of these wax seal stickers strong enough? Yes, the adhesive on the back of the wax seal stickers is very strong and the adhesive area is also large enough, suitable for mailing. We have done some testing ourselves and they all meet the standard. Are these wax seal stickers made of real wax ? Yes, they are made with high-qulity real wax. Do you have any other colors, sizes, and styles of wax seals available? Certainly! We offer a wide range of colors, sizes, and designs for customers to choose from. You can browse our store for more options by searching for \"wax seal stickers\".",
    "rating": 4.8,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "36 Rolls | 2.4 mil Clear | 110 Yards Each (3960 Yards Total) | 2\" Premium Packing Tape Heavy Duty Packaging Tape for Shipping Moving Stronger Thicker",
    "price": 48.75,
    "image": "https://m.media-amazon.com/images/I/71qDNWVYn5L._SL1500_.jpg",
    "description": "About this item ✅【 Extra Sticky & Long Lasting Hold 】Our packing tapes are made with stronger adhesives allowing them to stick to almost any smooth surface, ensuring your contents are securely sealed and held together no matter the size or weight. Seal it and forget it, our tapes stays seals forever, perfect for long term storage and extra security. ✅【 Highly Transparent & Crystal Clear Finish 】These packaging tapes are completely see-through providing a clean, professional look that won’t obstruct text or labels. Our tapes do not leave a slightly yellow streak when applied which can be apparent with lower quality tapes. ✅【 Wholesale Supplier 】We specialize in supplying small businesses while also focusing on the every day needs at home. Whether you are planning a small move or packing large amount of boxes, we are here for you. We ship over 50,000 packages a day and we can confidently say we use these exact tapes for our operations! ✅【 Specifications 】Quantity: 36 Pack; Length per roll: 110 yards; Total Length: 3960 yards; Thickness: 2.4 mil; Width of Tape: 2 inches; Core Diameter: 3 inches ✅【 Fits on Handheld Dispensers / Tape Guns 】Our 2' packing tape is the standard size rolls and compatible with standard hand-held dispensers or tape guns. ✅【 Purchase With Confidence】Our mission at Lifetime Supplies is to provide high quality products at an exceptional price! For any reason if you're not completely satisfied or if you have any issues with the product, please let us know and we will be happy to help! › See more product details",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "VIVO Electric Sit Stand Desk Frame, Dual Motor Memory Controller Height Adjustment, Frame Only, Black, DESK-E-200B",
    "price": 159.99,
    "image": "https://m.media-amazon.com/images/I/61f9dArabUL._AC_SL1500_.jpg",
    "description": "ELECTRIC DUAL MOTOR DESK FRAME The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Sit or stand on demand throughout the day and program your preferred desk heights with the simple push-button controller. This solid frame features dual thermal motors and 2-stage telescopic height adjustment columns that support up to 220 lbs. Previous page Supports up to 220 lbs Sturdy Steel Construction The all-steel design is scratch-resistant and solid for excellent support that lasts. Next page 1 CONTROL PANEL 2 DUAL MOTOR LIFT 3 STURDY FRAME 4 HEIGHT ADJUSTABLE Available in Black or White Create Your Own Active Workstation Solid 60\" Tops Curved 60\" Tops 3 Piece 72\" Tops Top Dimensions 59\" x 23.6\" Top Dimensions 63.1\" x 31.5\" Top Dimensions 70.9 x 29.5\" Top Thickness 1.1\" Top Thickness .75\" Top Thickness 1\" Colors Black, Light Wood, Dark Walnut, Grey, Vintage Brown, White Colors Black, Carbon Fiber, Light Wood, Dark Walnut, Grey, Vintage Brown, White Colors Black, LED, Lt Wood, Dk Walnut, Grey, Vintage, White, Lt Wood/Wt, Vintage/Blk",
    "rating": 4.7,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "UniqueMe 6 Pack for Apple Watch Screen Protector 40mm, Apple Watch SE Series 6/5/4 Screen Protector [Upgrade Flexible Film] Anti-Scratch [Non-Bubbles] Soft HD TPU Clear Film for iWatch 40mm",
    "price": 7.88,
    "image": "https://m.media-amazon.com/images/I/71UjKfK5loL._AC_SL1500_.jpg",
    "description": "UniqueMe for Apple Watch Screen Protector Apple Watch 40mm Add to Cart Apple Watch 44mm Add to Cart Apple Watch 41mm Add to Cart Apple Watch 45mm Add to Cart Apple Watch 49mm Add to Cart Apple Watch 42mm Add to Cart Apple Watch 46mm Add to Cart Customer Reviews 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 4.3 out of 5 stars 49,548 Price $7.88$7.88 $7.99$7.99 $6.98$6.98 $7.83$7.83 $8.77$8.77 $7.89$7.89 $7.91$7.91 Size Apple Watch 40mm Apple Watch 44mm Apple Watch 41mm Apple Watch 45mm Apple Watch 49mm Apple Watch 42mm Apple Watch 46mm Model Apple Watch Series 6/5/4/SE Apple Watch Series 6/5/4/SE Apple Watch Series 7/8/9 Apple Watch Series 7/8/9 Apple Watch Ultra 1/2（2024） Apple Watch Series 10 Apple Watch Series 10 Materials Soft TPU Soft TPU Soft TPU Soft TPU Tempered Glass Soft TPU Soft TPU Color Transparent Transparent Transparent Transparent Transparent Transparent Transparent Quality 6 Packs 6 Packs 8 Packs 8 Packs 4 Packs 8 Packs 8 Packs Previous page Next page 1 Waterproof 2 Protective 3 Touch Sensitive 4 Put on Freedom",
    "rating": 4.3,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Smead Card Guide, Plain 1/5-Cut Tab (A-Z), 8\"W x 5\"H, Manila, 25 per Set (57076)",
    "price": 11.46,
    "image": "https://m.media-amazon.com/images/I/61bP-n5Q4NL._AC_SL1500_.jpg",
    "description": "Use card guides for cross-reference indexes, desktop reference files, account lists or patient or customer address lists. Use alphabetic indexed guides for cross-referencing accounts in large numeric filing systems.",
    "rating": 4.5,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "10 Pieces Stapler for Desk Staplers Bulk with 6000 Staples Office Stapler 25 Sheet Capacity Staplers Pack for School Office (Black)",
    "price": 39.99,
    "image": "https://m.media-amazon.com/images/I/71y9SIKZB2L._AC_SL1500_.jpg",
    "description": "Anti-slip base Keep the stapler in place during use, avoid slipping. Opening for tacking Can be opened very wide, easy to tack papers to bulletin boards. Easy to Refill staples Quickly see when you’ re running low on staples. Holds up to 120 staples.",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "6 Pack Clear Drawer Organizer Set, Acrylic Drawer Storage Trays, Storage Bins for Makeup, Cosmetics, Jewelries, Utensils, Gadgets, Office",
    "price": 8.99,
    "image": "https://m.media-amazon.com/images/I/71A3Rxes3kL._AC_SL1500_.jpg",
    "description": "Premium Material Stackable Design Non-Slip Inside Design Non-Slip Outside Design Previous page Next page 1 Makeup Organizer 2 Bathroom Organizer 3 Office Organizer 4 Ornaments Organizer 5 Kitchen Organizer",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Extra Capacity Plastic Hanging File Folder,12 Pack Reinforced Hang Folders Letter Size,Heavy Duty 2 Inch Expansion,Filing Cabinet Folders,for Bulk Files, Medical Charts,Assorted Colors",
    "price": 23.79,
    "image": "https://m.media-amazon.com/images/I/71qYjCfUPYL._AC_SL1500_.jpg",
    "description": "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Previous page Next page 1.What is the difference between our folders and other folders on the market? Our hanging file folder letter size extra capacity are made of plastic material. Compared to paper materials, it is not easily damaged, durable, and can maintain optimal performance even after prolonged use. 2.Will the bottom break after loading a lot of heavy duty files? The colored hanging file folders come with a 2-inch expansion strips of plastic board to place into the bottom of the folder. Reinforced the bottom, perfectly solving the problem of bottom damage in heavy-duty files. 3.What size files are suitable for this plastic hanging file folders？ It is suitable for standard letter size files(8.5 x 11 inch), standard letter size paper documents, Manila folders, and filing cabinets. Before purchasing, you can check the size of the filing cabinet to ensure it meets the letter size requirements. 4.How many files can this folder hold? Each folder can hold up to 500 sheets of letter size paper and can bear a weight of 5.5 pounds. 5.How many labels do 12 pack extra capacity hanging file folders come with? There is 15 insertable transparent tabs,which can customize the content you want and insert it in the appropriate location at the same time. New Release Colored Hanging Folders Add to Cart Side Seal Hanging Folders Add to Cart 1 inch Hanging Folders Add to Cart Legal Hanging Folders Add to Cart Hanging File Organizer Buying Options Customer Reviews 4.4 out of 5 stars 111 4.2 out of 5 stars 85 4.2 out of 5 stars 33 4.1 out of 5 stars 22 3.9 out of 5 stars 5 Price $23.79$23.79 $25.99$25.99 $22.19$22.19 $26.19$26.19 — Material Plastic Plastic Plastic Plastic Metal + Plastic Brand Shutex Shutex Shutex Shutex Shutex Size Letter Size Letter Size Letter Size Letter Size Letter Size Side Seal ✘ ✔ ✘ ✘ ✘ Folder Expansion 2 inch 2 inch 1 inch 2 inch 2 inch Quantity 12 Pack 12 Pack 12 Pack 12 Pack Metal Organizer+5 Poly Folder More Different Color Options In Our Stock Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Heavy Duty Hanging Folder Add to Cart Customer Reviews 4.4 out of 5 stars 111 4.4 out of 5 stars 111 4.4 out of 5 stars 111 4.4 out of 5 stars 111 4.4 out of 5 stars 111 4.4 out of 5 stars 111 4.4 out of 5 stars 111 Price $23.59$23.59 $22.69$22.69 $22.99$22.99 $22.69$22.69 $22.69$22.69 $18.99$18.99 $22.69$22.69 Material Plastic Plastic Plastic Plastic Plastic Plastic Plastic Brand Shutex Shutex Shutex Shutex Shutex Shutex Shutex Size Letter Letter Letter Letter Letter Letter Letter Bottom Gasket ✔ ✔ ✔ ✔ ✔ ✔ ✔ Color Black Pink Grey Purple Blue Green Red Expansion 2 inch 2 inch 2 inch 2 inch 2 inch 2 inch 2 inch Quantity 12 Pack 12 Pack 12 Pack 12 Pack 12 Pack 12 Pack 12 Pack",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "100 Pack Coin Envelopes 3.23\"×4.53\",Brown Kraft Small Envelopes,Fully sealed seed envelope，Kraft Small Coin Envelopes,Seed Envelopes, Mini Envelopes for Office, Home, School",
    "price": 5.99,
    "image": "https://m.media-amazon.com/images/I/71yRi8tM7LL._AC_SL1500_.jpg",
    "description": "Coin Envelopes Coin Envelopes Brown Kraft Small Envelopes Kraft Small Coin Envelopes",
    "rating": 4.7,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Bestway Steel Pro MAX 12 Foot by 30 Inch Round Above Ground Swimming Pool Set Outdoor Metal Frame Family Pool with Filter Pump, Gray",
    "price": 130.99,
    "image": "https://m.media-amazon.com/images/I/71sG8T7cu6L._AC_SL1500_.jpg",
    "description": "About this item YOUR VERY OWN BACKYARD POOL: Make your home the place to be! The Bestway Steel Pro MAX Above Ground Pool offers summer fun for the whole family BUILT TO LAST: The durable outdoor pool frame is constructed with corrosion-resilient steel to ensure longevity; The ClickConnect System of frame connectors makes setting the pool up a breeze ENJOY FOR MANY SUMMERS: The DuraPlus liner of the portable pool is an ultra-durable 3-layer material reinforced for strength and puncture-resistance CRYSTAL CLEAR WATER: The included 530 gal filter pump keeps the pool above ground water fresh and looking crystal clear by circulating water out of the pool, through the filter, and back into the pool INCLUDES ALL YOU NEED: This above-ground pool set also comes with a filter pump and repair patch kit; With no tools required and built-in flow control valve, set up and take down is quick and simple › See more product details",
    "rating": 4.2,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Ospelelf Vintage Hardcover 3 Ring 1 inch Leather Binder, Professional Binder Organizer Suitable for Letter Size, Binder Dividers with Tabs, Faux Pink Leather",
    "price": 25.99,
    "image": "https://m.media-amazon.com/images/I/61q8E251BQL._AC_SL1500_.jpg",
    "description": "Multifunctional PU Leather Binder with Dividers Details 1-inch Rings Pen Loop Elastic Closure Waterproof PU Leather Cover Index dividers with tabs and label stickers for easy viewing Various Applications Previous page Next page 1 School 2 Photo Album 3 Home 4 Office",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "CASIO PRIZM FX-CG50 Color Graphing Calculator",
    "price": 82.18,
    "image": "https://m.media-amazon.com/images/I/71+o94+5KIL._AC_SL1500_.jpg",
    "description": "Advanced Color Graphing Calculator with Natural Textbook Display and intuitive icon-based menu. Easy to Use. 3 Dimensional Graphing capability. Improved Catalog function allows for greater engagement and real life application in the mathematics classroom. Approved for AP, SAT I/II, PSAT, NMSQT, ACT Tests (permitted on all major exams).",
    "rating": 4.8,
    "in_stock": false,
    "currency": "USD"
  },
  {
    "title": "Vacuum Suction Magnetic Car Phone Holder, Adjustable Electric Magnetic Phone Holder Mount for Car, Foldable Strong Suction Car Holder Mount for iPhone16/15/14/13/12,Shower/Car/Mirror(Not Charge Phone)",
    "price": 26.69,
    "image": "https://m.media-amazon.com/images/I/5179rAeGdxL._AC_SL1040_.jpg",
    "description": "Pls subject to Qidelong Direct Store to obtain certified goods& reliable service Electric Vacuum Suction Magnetic Phone Holder Adjustable Suction Phone Mount Pls confirm to order from Qidelong Direct Store to get certified item",
    "rating": 3.7,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Super Glue for Plastic 100g, Heavy Duty Plastic Glue Model Kit for Legos and Miniature, Strongest Plastic Adhesive Bonder for PLA, 3D Print, Car, ABS, PVC, Acrylic, Craft, Best Plastic Glue",
    "price": 8.99,
    "image": "https://m.media-amazon.com/images/I/71sk2Al3ilL._SL1500_.jpg",
    "description": "In the heart of every craftsperson, DIY hobbyist lies a desire for perfection. Our brand's journey began with a simple need — a superior adhesive that truly bonds and lasts. Inspired by this quest, our founders set out to create Plastic Glue, a product that not only meets the highest standards of quality but also caters to the intricate needs of our diverse user base. From securing model airplanes to repairing household items, Plastic Glue stands as a testament to reliability and innovation. Heavy Duty Plastic Glue for PLA, 3D Print, Car, ABS, PVC, Acrylic, Craft ALL-PURPOSE PLASTIC ADHESIVE: Perfect for PVC, ABS, acrylic, and more – Plastic Glue handles all your plastic repair needs with ease. LONG-LASTING BOND: Our advanced formula provides a strong, durable bond for projects big and small, from model airplanes to household items. QUICK SETTING: No more waiting around – Plastic Glue dries in seconds, making your repairs fast and efficient. SAFE & ODORLESS: Enjoy a safe, non-toxic, and odor-free application that leaves a clear, clean finish with no residual marks. PRECISION APPLICATION: The included precision tip ensures accurate glue placement for intricate repairs and professional results every time. Easy To Use Clean and dry surfacess sand glossy areas lightly Apply a small amount of glue using the precision nozzle. Press surfaces together for at least 5 minutes; Wipe the nozzle after use.Let the glue cure for 24 hours Before Vs After",
    "rating": 4.5,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Koala Thin Presentation Paper Double-Sided Matte for Printing Photo 8.5X11 Inches 110 Sheets, Compatible with Inkjet Printer",
    "price": 14.99,
    "image": "https://m.media-amazon.com/images/I/71qNaqNu6QL._AC_SL1500_.jpg",
    "description": "Previous page Thin Matte Paper for Double-sided Printing Good Ink Absorption, True Color Reproduction, Brilliant Colors Perfect Work with Inkjet Printers and Dye Ink, Fast Dry Photo Projects with Smooth Matte Finish Next page 1 Double-sided Printing 2 Crisp Colorful Printouts 3 Quick Dry 4 Smooth Matte Finish Koala Photo Paper Series Double-sided Matte Paper Add to Cart Thin Glossy Inkjet Paper Add to Cart Inkjet Glossy Photo Paper Add to Cart Thick Glossy Photo Paper Add to Cart Semi-Gloss Photo Paper Add to Cart Double-sided Glossy Paper Add to Cart Pearl Glossy Photo Paper Add to Cart Customer Reviews 4.6 out of 5 stars 586 4.6 out of 5 stars 5,214 4.6 out of 5 stars 3,884 4.4 out of 5 stars 179 4.2 out of 5 stars 76 4.7 out of 5 stars 58 4.2 out of 5 stars 42 Price $14.99$14.99 $14.99$14.99 $15.95$15.95 $17.99$17.99 $16.99$16.99 $19.99$19.99 $9.99$9.99 Compatible printers Inkjet Inkjet Inkjet Inkjet Inkjet Inkjet Inkjet Paper size 8.5X11\" 8.5X14\" 8X10\" 8.5X11\" 8.5X11\" 8.5X11\" 8.5X11\" Paper finish Double-sided Matte Single-sided Glossy Single-sided Glossy Single-sided Glossy Single-sided Semi Glossy Double-sided Glossy Single-sided Pearl Glossy Paper weight 32LB 30LB 48LB 54LB 48LB 54LB 48LB Sheet Count 110 Sheets 100 Sheets 100 Sheets 100 Sheets 100 Sheets 100 Sheets 30 Sheets",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "310 Pcs Gold Push Pins Set, Gold Thumb Tacks Decorative Push Pins for Cork Board with Push Pin Hook Pushpin Clip 5 Style Gold Office Accessories for Cork Board Map Office",
    "price": 11.99,
    "image": "https://m.media-amazon.com/images/I/71Z5ZyH-TSL._AC_SL1500_.jpg",
    "description": "Question Will these fade? Generally not, you can use it with confidence Can it be used with confidence? Yes, the thumbtacks are well made and will not fall off when used, so you can use them with confidence Specifications: Material: plastic and metal Size:gold push pins approx 0.71*0.14 inch gold thumb tacks approx 0.39 *0.31inch gold map tacks approx 0.16*0.43 inch gold thumb tacks with clips approx 1.18*1.3 inch gold pin wall hooks approx 0.71*0.47 inch Package include:100 x Gold Push Pins , 100 x Roundness Thumb Tack , 100 x Map Tack , 5 x Gold Push Pins Clip , 5 x Gold Push Pin Hooks Multipurpose: Push pins use to pin important messages on cork board, foam board, map and more. Pushpin clips can be used to hold documents, photos, won't leave holes. Map pins are suitable for marking geographic locations Thumbtack hooks can be used to hang small items like keys, necklaces, scissors. Applicable panel:Suitable for bulletin board, cork board, partition wall, memory wall, pin board. Well Packaged:With a plastic packaging box, it can be used as a gift for family, classmates and friends. It is a good gift choice for festivals, moving, weddings, and housewarming. Excellent Material: Our push pins are made of high-quality plastic and rigid tips, which are reliable and sturdy. The thumbtack hooks and thumbtack clips are made of high-quality metal materials, which are not easy to break and can be used for a long time 310 Pcs Gold Push Pins Set 500 Pcs Black Push Pins Set 310 Pcs Rose Gold Push Pins Set 310 Pcs Silver Push Pins Set 200 Count Gold Push Pins 40 Count 1.5 Inch Giant Push Pins Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Add to Cart Customer Reviews 4.6 out of 5 stars 266 4.5 out of 5 stars 302 4.5 out of 5 stars 302 4.5 out of 5 stars 302 4.6 out of 5 stars 121 4.7 out of 5 stars 269 Price $11.99$11.99 $9.99$9.99 $9.99$9.99 $9.99$9.99 $6.99$6.99 $9.99$9.99 Color Gold Black Rose Gold Silver Gold Clear Quantity 310 Pcs 500 Pcs 310 Pcs 310 Pcs 200 Pcs 40 Pcs Material Plastic and Metal Plastic and Metal Plastic and Metal Plastic and Metal Plastic and Metal Plastic and Metal",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Magnetic Neck Mount for Phones, POV Phone Holder, Vlog Neck Mount with Anti-Vibration Chest Strap for GoPro for Insta360, Magnetic Phone Neck Holder for iPhone 16 15 14 13 12 Series",
    "price": 22.99,
    "image": "https://m.media-amazon.com/images/I/61Ul46zr0FL._AC_SL1500_.jpg",
    "description": "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. 2025 Series Grey Black Light Grey Upgrade Adjustable, Foldable, Hand Free, Quick Release Button, Lightweight Upgrade Adjustable, Foldable, Hand Free, Quick Release Button, Lightweight Upgrade Adjustable, Foldable, Hand Free, Quick Release Button, Lightweight Wide Compatibility Compatible for Smart Phone and Sport Camera Wide Compatibility Compatible for Smart Phone and Sport Camera Wide Compatibility Compatible for Smart Phone and Sport Camera",
    "rating": 4.5,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "SentrySafe Black Fireproof Safe with Digital Push Button Keypad, Home Safe For Money, Documents, and other Valuables, 1.23 Cubic Feet, SF123ES",
    "price": 229.99,
    "image": "https://m.media-amazon.com/images/I/61IFGhdN7gL._AC_SL1500_.jpg",
    "description": "Keep your valuables protected with the SentrySafe Fireproof Money Safe. Measuring 17.8 x 16.3 x 19.3 inches, this black safe is perfect for keeping important documents, money, and small items secure in your home or office. The fireproof design ensures that your belongings stay safe even in the event of a disaster. This lock box features a shelf for easy organization and access to your items. It also comes with a key lock to provide added security and peace of mind. Whether you need a safe for money, documents, or other small valuables, this fireproof safe box is an ideal solution. This Fireproof safe is UL Classified to endure 1 hour at 1700°F and keep the interior temperatures safe for irreplaceable documents, valuables, DVDs, and USBs or other valuables. Its compact size makes it easy to fit in any space while still providing ample room for your essentials. SentrySafe is known for its reliable and durable safes for home use, and this fireproof document box is no exception. This safe will meet all of your security needs.",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Trideer Ball Chair Yoga Ball Chair Exercise Ball Chair with Base for Home Office Desk, Stability Ball & Fitness Ball Seat to Relieve Back Pain, Home Gym Workout Ball for Abs, Pregnancy Ball with Pump",
    "price": 39.99,
    "image": "https://m.media-amazon.com/images/I/61+tAuFGIrL._AC_SL1500_.jpg",
    "description": "Previous page Next page Previous page Next page",
    "rating": 4.3,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "onelinkmore Headphone Splitter, 5-Jack 3.5 mm Audio Headphone Splitter Stereo Audio Headset Adapter, Audio Earbuds Earphones Plug 5 Way 1 Male to 4 Female Splitter with 3.5mm Stereo Cable",
    "price": 5.88,
    "image": "https://m.media-amazon.com/images/I/51nvESwXdyS._AC_SL1500_.jpg",
    "description": "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. 5-Jack Audio Headphone Splitter Simply plug the splitter into any device with a 3.5mm auxiliary port, connect up to five headphones to one device for sharing music without being noisy in any places,each port can be output end or input end, mixing and fade-ins controlled,The splitter works with any device equipped with a 3.5-millimeter auxiliary port including smartphones, tablets, laptops, and more. 5 Way - Multi Headphone Splitter The installation is very simple, you only need to put the audio output port of MP3, CD, MD, he inserts, computer, and the speaker or Headset are respectively connected into the two output interface can be. Compatible with iPhone,iPod,iPad,Samsung,Blackberry,Tablets,mp3,laptops or other portable DVD players Multiple Headphone Audio Adapter for Classroom and Travel It's a perfect traveling companion for long road trips and plane rides. Parents can enjoy a peaceful drive while their kids listen to music, watch a movie, or listen to an audiobook. It also makes an effective learning tool, up to five students can listen to the same audiobook or podcast at a time.Earphone splitter is made of ABS plastic material,with compact portable size.",
    "rating": 4.5,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "#10 Envelopes Letter Size Self Seal | 100 Business Mailing Security Peel and Sealing Envelope | 100% Tinted | no 10 White Windowless Legal Regular Plain Envelops Pack | 4-1/8 x 9-1/2 Inches | 24 LB",
    "price": 8.95,
    "image": "https://m.media-amazon.com/images/I/71tYZ-nDKTL._AC_SL1500_.jpg",
    "description": "100#10 Envelopes, Self Seal Business Envelopes, Letter Legal Size #10 Envelopes Letter Size Self Seal, 500 Envelopes 1000#10 Envelopes Letter Size - Self Seal Security Mailing Envelopes -Business Add to Cart Add to Cart Add to Cart Customer Reviews 4.8 out of 5 stars 5,427 4.6 out of 5 stars 7,838 4.7 out of 5 stars 143 Price $8.95$8.95 $26.95$26.95 $46.95$46.95 Pack 100 500 1,000 Price $9.95 $26.95 $49.95 Price Per Envelope $0.09/Count $0.05/Count $0.04/Count",
    "rating": 4.8,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Gun Safe, Biometric Pistol Safe Drop Down Handgun Safe Mounted Single Gun Safe for Handgun with Fingerprint Passcode Key 3 Ways Quick Access Car Gun Safe for Nightstand, Desk, Vehicle",
    "price": 79.99,
    "image": "https://m.media-amazon.com/images/I/7107l6GDI7L._AC_SL1500_.jpg",
    "description": "3Wasys Of Access Easy to Mount Mounting Dimension Use It Where You Need Previous page Next page Protect Your Family Compare HOLEWOR Gun Safe Pistol Safe Drop Down Add to Cart Portabel Small Gun Safe Add to Cart Gun Safe with LCD & USB Add to Cart Slide Away Bluetooth Safe Add to Cart LCD of Temp & Humidity Add to Cart LCD of Time & Battery Add to Cart Drop Down Safe Biometric Add to Cart Customer Reviews 4.4 out of 5 stars 480 4.3 out of 5 stars 528 4.6 out of 5 stars 1,312 4.5 out of 5 stars 51 4.6 out of 5 stars 1,312 4.5 out of 5 stars 390 4.4 out of 5 stars 480 Price $79.99$79.99 $69.99$69.99 $79.99$79.99 $209.99$209.99 $79.99$79.99 $79.99$79.99 $89.99$89.99 USB-C Port ✔ ✘ ✔ ✔ ✔ ✔ ✔ LCD Display ✔ ✘ ✔ ✔ ✔ ✔ ✔ Fingerprint ✔ ✔ ✔ ✔ ✔ ✔ ✔ Passcode ✔ ✘ ✔ ✔ ✔ ✔ ✘ Keys ✔ ✔ ✔ ✔ ✔ ✔ ✔ Silent Mode ✔ ✘ ✔ ✘ ✔ ✘ ✔ Interior Light ✔ ✔ ✔ ✔ ✔ ✔ ✔ Capacity 1 Gun & ammo 1 Gun & ammo 2 Guns & ammo 3-5 Guns & ammo 2 Guns & ammo 2 Guns & ammo 1 Gun & ammo Weight 9 lb 4.6 lb 8.8 lb 23.8 lbs 8.5 lb 8.8 lb 9 lb Size 15.6x7.87x2.76 inches 11.4x7.1x2.5 inches 12.6x9.84x3.15 inches 13.8 x 16.3 x 5.9 inches 12.6x9.84x3.15 inches 12.6x9.84x3.15 inches 15.6x7.87x2.76 inches",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Avery Matte White Round Labels with Sure Feed, 2\" Diameter, 300 Matte White Printable Labels",
    "price": 18,
    "image": "https://m.media-amazon.com/images/I/71+cMk64JVL._AC_SL1500_.jpg",
    "description": "Matte white Avery labels are the perfect choice for any project. The smooth, matte white finish is a great fit whether you're designing product labels, shipping packages for work, making party favors or adding a creative touch to personal crafts or school projects. Each sheet of labels features Sure Feed technology which helps deliver a more reliable feed through your printer to prevent print misalignments and paper jams. The print-to-the-edge feature makes it easy to print beautiful designs that can reach the edges of the label without a border or outline. Quickly apply these labels with our patented Easy Peel label sheets with Pop-up Edge. Simply fold the sheet back to display the label edges for convenient and fast peeling. A strong permanent adhesive is used to ensure that these labels stick and stay to paper, cardboard, plastic, glass, metal and more without curling or falling off. The versatile label shape can adapt to almost any use, just create your design with our free software and print. Avery Design & Print makes it easy to create customized labels from your own home or business so that you can print professional designs with your laser or inkjet printer. Our free browser-based software includes predesigned templates as well as tools for editing text and images so that you can create soap labels, candle labels, branding labels, food labels and more. Try it out today by searching for Avery template Presta 94501 on the Avery site.",
    "rating": 4.7,
    "in_stock": false,
    "currency": "USD"
  },
  {
    "title": "maxtek Rolling Whiteboard, 48x36 Large Magnetic White Board with Stands, Big Double-Sided White Board Dry Erase on Wheels for Homeschool, Home Office, Office, School (Silver, 48 x 36)",
    "price": 109.99,
    "image": "https://m.media-amazon.com/images/I/61ILv6oK5QL._AC_SL1500_.jpg",
    "description": "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked. Previous page Next page Previous page Next page 1 For Homeschool 2 For Home Office 3 For Classroom 4 For Office Recommentation from maxtek Rolling Whiteboard RW5 Add to Cart Easel Whiteboard EW1 Add to Cart Adjustable Whiteboard AW1 Add to Cart Rolling Whiteboard RW3 Add to Cart Rolling Whiteboard RW1 Add to Cart Rolling Whiteboard RW2 Buying Options Rolling Whiteboard RW4 Add to Cart Customer Reviews 4.4 out of 5 stars 96 4.5 out of 5 stars 3,689 4.6 out of 5 stars 300 4.3 out of 5 stars 703 4.3 out of 5 stars 703 4.3 out of 5 stars 703 4.4 out of 5 stars 96 Price $109.99$109.99 $59.99$59.99 $269.99$269.99 $199.99$199.99 $199.99$199.99 — $189.99$189.99 Accessories Included 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser 6 magnets，3 markers，1 eraser Finish Type Baking Finish Baking Finish Baking Finish Baking Finish Baking Finish Baking Finish Baking Finish Dimension 47.3\"x 31.5\"x71.2\"h 35.5\"x23.6\"x42.4～63.2\"H 47.4\"x59.3\"x47.2～76\"H 59.5\"x 47.4\"x72.8\"H 71.4\"x 39.5\"x75.6\"h 71.4\"x 39.5\"x75.6\"H 71.4\"x 35.5\"x74.2\"H Magnetic Surface ✔ ✔ ✔ ✔ ✔ ✔ ✔ Marker Tray ✔ ✔ ✘ ✔ ✔ ✔ ✔ Double Side ✔ ✘ ✔ ✔ ✔ ✔ ✔ Adjustable Height ✘ ✔ ✔ ✘ ✘ ✘ ✘ Thickened packaging ✔ ✔ ✔ ✔ ✔ ✔ ✔",
    "rating": 4.4,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Brother PT-E560BTVP P-Touch Edge Handheld Industrial Label Printer with Bluetooth and Dual auto-Cutter (up to 24mm Labels)",
    "price": 238,
    "image": "https://m.media-amazon.com/images/I/61h2WIg199L._AC_SL1500_.jpg",
    "description": "Designed to support contractors in large project applications, the P-Touch EDGE 560BT is loaded with features to streamline labeling for techs. Format laminated labels and heat shrink tubes up to 24mm for your applications in fewer steps using the included ruler and quick application keys. Store your databases and templates, intuitively serialize and create QR codes and linear barcodes straight on the printer itself to cut out wasted time from repetitive tasks. Rather work on your phone or computer? Get the job done from your mobile device thanks to Bluetooth® wireless connectivity and the Pro Label tool app. Or, connect and charge from your PC with a common USB-C® cable and print from the P-Touch Editor software. Then, watch the auto-cutter print a strip of labels with half-cuts to make peeling and applying labels a cinch. Add in a secure hand strap to help prevent drops and a long-lasting battery and the PT-E560BT is the go-to tool for crushing tasks with the precision and efficiency of a seasoned pro.",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "MAGEASY for iPhone 16 Pro Max Case with Strap - 20ft Ultimate Drop Protection Compatible with MagSafe, Transformable 2-in-1 Protective & Lanyard Case, Aluminum Frame | Odyssey Strap M (Titanium)",
    "price": 44.99,
    "image": "https://m.media-amazon.com/images/I/71BCtI2si0L._AC_SL1500_.jpg",
    "description": "Previous page Next page 1 Transformable Case 2 Compatible with MagSafe 3 Ultimate Defense System 4 All About Details 5 20ft Drop Protection MAGEASY Case Collection for iPhone 16 Series Odyssey Strap M Add to Cart Odyssey Ultra M Add to Cart Odyssey Stand M Add to Cart Odyssey M Add to Cart Roam M Add to Cart Pouch M Add to Cart MagStand 360 M Add to Cart Customer Reviews 4.6 out of 5 stars 43 4.1 out of 5 stars 12 4.3 out of 5 stars 18 4.8 out of 5 stars 29 4.4 out of 5 stars 45 4.1 out of 5 stars 53 4.8 out of 5 stars 17 Price $44.99$44.99 $70.39$70.39 $38.24$38.24 $31.99$31.99 $34.99$34.99 $54.99$54.99 $39.99$39.99 Main Feature Protective, Strap Protective, 360° Stand, Strap Protective, 360° Stand Protective Case Shockproof, Strap Detachable Wallet, Strap Shockproof, 360° Stand Drop Protection (Max Height) 20ft 25ft 20ft 20ft 16ft 16ft 16ft Compatible with MagSafe ✔ ✔ ✔ ✔ ✔ ✔ ✔ Built-in 360° Stand ✘ ✔ ✔ ✘ ✘ ✘ ✔ Included Strap MAGEASY 20mm Strap MAGEASY Utility Strap — — MAGEASY 6mm Strap MAGEASY Leather Strap — Available Colors Black, Silver, Titanium Frame Titanium Frame Black, Titanium Frame Black, Silver, Titanium Frame Black, Gray, Rosé, Translucent Black, Rosé, Camel, Gray, etc. Clear, Black, Gray, Rosé",
    "rating": 4.6,
    "in_stock": true,
    "currency": "USD"
  },
  {
    "title": "Selfie Stick, 41'' Extendable Phone Tripod Stand with Phone Holder & Detachable Remote, 360° Rotation Selfie Stick Tripod for Cell Phone Compatible with iPhone, Android, Samsung",
    "price": 9.99,
    "image": "https://m.media-amazon.com/images/I/71RapjmjT3L._AC_SL1500_.jpg",
    "description": "About this item 【All-in-One Selfie Stick】 Bringing this selfie stick on your trip means you own a selfie stick, a phone tripod, and a tabletop phone stand, all in one device. Use it as a regular selfie stick or as a quick and easy tripod for stable shots. And it with detachable and extendable phone clip, compatible with most smart phones within 2.5-3.7 inch (65-95mm). It can be detached to used as a tabletop cell phone stand after, making it convenient for you to watch videos, TV show and make video calls. 【41\" Extendable Selfie Stick】 With 7-section adjustable telescopic poles, the phone selfie stick tripod stand is long, can be adjusted from 7.7 in (19.6cm) to 41.7 in (106cm), can capture a wider landscape, easy to photograph the whole body instead of the part. In normal conditions on a flat surface, The shorter it is extended, the more stable it will be. It great for Selfies, Group Photos, Face-time, Life-Vlog, Video shooting, Social life. 【Adjustable Angle and Rotatable Phone Holder】 Cell phone tripod adopts a 360° rota-table mobile phone clip and a 225° elevated and overhead shots design to help you quickly find the best shooting angle to get the composition is more diversified, allow you could take photos, video call or live broadcasting. The phone clip is equipped with soft silicone and protect your phone or devices from scratches or falls down. Suitable for family gatherings and friends reunions, trips, etc. 【Detachable Remote Shutter】 Cell phone tripod with built-in wireless remote control, support shooting within 30 feet (10 meters), compatible with IOS/Android, very easy to operate, no need to use APP. You can easily press the button to shoot, is excellent for snapping selfies or group photos from afar. And it has a detachable design when the remote control is not in use, it can be put into the special remote control slot on the handle of the selfie stick for phone to prevent it from being lost. 【Lightweight & Portable】 Selfie stick thanks to the hidden retractable design, when folded up size 7.7 inch (19.6 cm), weigh 5.5 oz (156g), it can be easily packed in your bag, backpack or suitcase without taking up more space. The phone tripod stand is easy to carry nice, which is great for traveling, hiking, camping. Whenever you want to capture a beautiful moment, it's right there. › See more product details",
    "rating": 4.2,
    "in_stock": true,
    "currency": "USD"
  }
]